<script setup>
import {onMounted, reactive, ref} from "vue";
import { Fancybox } from "@fancyapps/ui/dist/fancybox/";
import "@fancyapps/ui/dist/fancybox/fancybox.css";

const tours = reactive([
    {
        id: 'tour1',
        name: 'Далат',
        content: `
            <h2>
    Далат
</h2>
<p>
    Сбор из отеля с 5ч 00 до 5ч 30.
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Горный перевал( завтрак )</li>
    <li>2. Озеро любви и французские кварталы</li>
    <li>3. Кофейные плантации и самый большой кофешоп в Далате</li>
    <li>4. Золотой Будда</li>
    <li>5. Крейзи хаус (Сумасшедший дом) Мировое произведение искусства.</li>
    <li>6. Пагода Линь Фуок (построена из стекла и битой посуды) входит в ТОП 10 самых красивых и необычных пагод мира.</li>
    <li>7. Обед</li>
    <li>8. Водопад Слон</li>
    <li>9. Богиня Гуань Инь 72 метра</li>
    <li>10. Шелковая фабрика</li>
    <li>11. Зоопарк. Ферма слонов и страусов (катание по желанию)</li>
</ul>

<h5>
    Стоимость 33$
</h5>
<p>
    С 5:00 до 20.00
</p>
<p>
    Трансфер, обед, гид, все выходные билеты
</p>
            `,
        quote: `
        <p>
    Сбор гостей с 5:00 до 5:20 — будьте на ресепшене вовремя.
</p>
<p>
    С вечера до 18:00 попросите на ресепшене ланч-бокс — он пригодится на завтрак. В пути будет остановка на перекус.
</p>
<p>
    Не забудьте кофту — в горах прохладнее, чем в городе.
</p>
<p>
    Если у вас есть подушка для шеи, как на перелёты — возьмите с собой, чтобы ехать было комфортнее.
</p>
<p>
    Ненужные вещи можно оставлять в автобусе во время остановок. Ценные вещи берите с собой.
</p>
<p>
    При посещении пагод у девушек должны быть прикрыты плечи и колени.
</p>
<p>
    Возьмите наличные деньги в донгах на личные расходы: ужин, магазины, корм для животных.
</p>
<p>
    Дорога будет проходить по горному серпантину. Если вас укачивает, заранее купите в аптеке таблетки от укачивания.
</p>
<p>
    За дополнительную плату можно покататься на страусах и слонах, а также приобрести в кофешопе натуральный кофе, чай, лекарственные средства и сладости после дегустации.
</p>

        `,
        gallery: [
            {
                type: 'image',
                src: 'assets/dalat/2.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/3.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/4.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/5.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/6.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/7.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/8.webp'
            },
            {
                type: 'image',
                src: 'assets/dalat/9.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/10.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/11.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/12.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/13.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/14.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/15.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/16.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/17.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/18.jpeg'
            },
        ],
    },
    {
        id: 'tour2',
        name: 'Супер Далат',
        content: `
            <h2>
    Супер Далат
</h2>
<p>
    Сбор из отеля с 5ч 00 до 5ч 30.
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Горный перевал</li>
    <li>2. Озеро любви и французские кварталы</li>
    <li>3. Кофейные плантации и самый большой кофешоп в Далате</li>
    <li>4. Глиняная деревня (творческий парк, Лики Любви в бесконечном озере)</li>
    <li>5. Crazy house</li>
    <li>6. Пагода Линь Фуок (построена из стекла и битой посуды) входит в ТОП 10 самых красивых и необычных пагод мира.</li>
    <li>7. Обед</li>
    <li>8. Водопад Датанла (Сани в стоимость не входят, оплачивается отдельно 130.000 донгов)</li>
    <li>9. Зоопарк. Ферма слонов и страусов (катание по желанию)</li>
</ul>

<h5>
    Стоимость 40$
</h5>
<p>
    С 5:00 до 20.00
</p>
<p>
    Трансфер, обед, гид, все выходные билеты
</p>
`,
        quote: `
        <p>
    Сбор гостей с 5:00 до 5:20 — будьте на ресепшене вовремя.
</p>
<p>
    С вечера до 18:00 попросите на ресепшене ланч-бокс — он пригодится на завтрак. В пути будет остановка на перекус.
</p>
<p>
    Не забудьте кофту — в горах прохладнее, чем в городе.
</p>
<p>
    Если у вас есть подушка для шеи, как на перелёты — возьмите с собой, чтобы ехать было комфортнее.
</p>
<p>
    Ненужные вещи можно оставлять в автобусе во время остановок. Ценные вещи берите с собой.
</p>
<p>
    При посещении пагод у девушек должны быть прикрыты плечи и колени.
</p>
<p>
    Возьмите наличные деньги в донгах на личные расходы: ужин, магазины, корм для животных.
</p>
<p>
    Дорога будет проходить по горному серпантину. Если вас укачивает, заранее купите в аптеке таблетки от укачивания.
</p>
<p>
    За дополнительную плату можно покататься на страусах и слонах, а также приобрести в кофешопе натуральный кофе, чай, лекарственные средства и сладости после дегустации.
</p>

        `,
        gallery: [
            {
                type: 'image',
                src: 'assets/dalat/2.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/3.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/4.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/5.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/6.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/7.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/8.webp'
            },
            {
                type: 'image',
                src: 'assets/dalat/9.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/10.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/11.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/12.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/13.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/14.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/15.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/16.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/17.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/18.jpeg'
            },
        ],
    },
    {
        id: 'tour3',
        name: 'Далат All in',
        content: `
        <h2>
    Далат All in
</h2>
<p>
    Сбор из отеля с 5ч 00 до 5ч 30.
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Горный перевал</li>
    <li>2. Водопад Мужские слезы</li>
    <li>3. Озеро любви</li>
    <li>4. Французские кварталы</li>
    <li>5. Кофейные плантации и самый большой кофешоп в Далате</li>
    <li>6. Глиняная деревня. Лики любви в бесконечном озере.</li>
    <li>7. Обед</li>
    <li>8. Долина любви</li>
    <li>9. Стеклянный мост длиной 325 метров с 7D визуальными и звуковыми эффектами</li>
    <li>10. Пагода Линьфуок. Храм построен из керамики, хрусталя и стекла</li>
    <li>11. Crazy house — Сумасшедший дом, произведение искусства</li>
    <li>12. Зоопарк</li>
    <li>13. Ферма слонов и страусов (катание по желанию)</li>
</ul>

<h5>
    Стоимость 55$
</h5>
<p>
    С 5:00 до 20.00
</p>
<p>
    Трансфер, обед, гид, все выходные билеты
</p>

`,
        quote: `
        <p>
    Сбор гостей с 5:00 до 5:20 — будьте на ресепшене вовремя.
</p>
<p>
    С вечера до 18:00 попросите на ресепшене ланч-бокс — он пригодится на завтрак. В пути будет остановка на перекус.
</p>
<p>
    Не забудьте кофту — в горах прохладнее, чем в городе.
</p>
<p>
    Если у вас есть подушка для шеи, как на перелёты — возьмите с собой, чтобы ехать было комфортнее.
</p>
<p>
    Ненужные вещи можно оставлять в автобусе во время остановок. Ценные вещи берите с собой.
</p>
<p>
    При посещении пагод у девушек должны быть прикрыты плечи и колени.
</p>
<p>
    Возьмите наличные деньги в донгах на личные расходы: ужин, магазины, корм для животных.
</p>
<p>
    Дорога будет проходить по горному серпантину. Если вас укачивает, заранее купите в аптеке таблетки от укачивания.
</p>
<p>
    За дополнительную плату можно покататься на страусах и слонах, а также приобрести в кофешопе натуральный кофе, чай, лекарственные средства и сладости после дегустации.
</p>

        `,
        gallery: [
            {
                type: 'image',
                src: 'assets/dalat/2.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/3.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/4.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/5.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/6.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/7.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/8.webp'
            },
            {
                type: 'image',
                src: 'assets/dalat/9.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/10.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/11.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/12.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/13.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/14.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/15.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/16.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/17.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/18.jpeg'
            },
        ],
    },
    {
        id: 'tour4',
        name: 'Фанранг',
        content: `
<h2>
    Программа Фанранг
</h2>
<p>
    07.00–07.30 Встреча гостей
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Ракушечный храм</li>
    <li>2. Лабиринт дракона</li>
    <li>3. Контактный зоопарк (более 20-ти видов, которых вы сможете покормить и погладить)</li>
    <li>4. Виноградники (дегустация вина, винограда и сушёных фруктов; можно приобрести для себя)</li>
    <li>5. Заповедник — бывший центр спасения морских черепах. Увидите старинный риф (более 1000 лет), потрясающий вид на море и фотозоны</li>
    <li>6. Обед</li>
    <li>7. Бухта Vĩnh Hy</li>
    <li>8. Прогулка на катере с прозрачным дном (снорклинг, купание)</li>
</ul>

<h5>
    Стоимость 45$
</h5>
<p>
    С 07:00 до 18:00 (выезд в Нячанг в 17:30–18:00)
</p>
<p>
    Включено: трансфер, обед, катер, гид, входные билеты
</p>

`,
        quote: `
<p>
    За вами заедут в 7:00–7:20.
</p>
<p>
    Успейте позавтракать до этого времени и ожидайте на ресепшене.
</p>
<p>
    Возьмите с собой купальные принадлежности, полотенце, головной убор, солнцезащитный крем и удобную обувь.
</p>
<p>
    Не забудьте взять немного денег на личные расходы — корм для животных, мороженое и сувениры.
</p>
<p>
    Обед включён в стоимость.
</p>
<p>
    Самое главное — хорошее настроение 😊 Наслаждайтесь поездкой!
</p>

        `,
        gallery: [],
    },
    {
        id: 'tour5',
        name: 'Фуйен',
        content: `
<h2>
    Программа Фуйен
</h2>
<p>
    Сбор гостей 06:00–06:30
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Самая восточная точка Вьетнама</li>
    <li>2. Первый электрический маяк</li>
    <li>3. Пляж Bai-Mon</li>
    <li>4. Базальтовые сады, оставшиеся после извержения вулкана</li>
    <li>5. Католический собор 1892 г. — храм в классическом готическом стиле</li>
    <li>6. Обед</li>
    <li>7. Храм морской Богини</li>
    <li>8. Центральная стела и набережная г. Туихоа</li>
</ul>

<h5>
    Стоимость 40$
</h5>
<p>
    С 06:00 до 17:00 (выезд в Нячанг)
</p>
<p>
    Включено: трансфер, обед, гид, входные билеты
</p>

`,
        quote: `
<p>
    За вами заедут в 06:00–06:20.
</p>
<p>
    Накануне закажите ланчбокс на ресепшене, чтобы вам собрали завтрак с собой.
</p>
<p>
    Возьмите с собой купальные принадлежности, полотенце, головной убор, солнцезащитный крем и удобную обувь.
</p>
<p>
    Не забудьте взять деньги на личные расходы.
</p>
<p>
    При посещении храма у девушек должны быть прикрыты колени и плечи.
</p>
<p>
    Обязательно вытащите предсказание в Храме Морской Богини 😊
</p>
<p>
    Обед включён в стоимость.
</p>
<p>
    Самое главное — хорошее настроение! Наслаждайтесь поездкой 😊
</p>

        `,
        gallery: [
            {
                type: 'image',
                src: 'assets/phuyen/1.jpeg'
            },
            {
                type: 'image',
                src: 'assets/phuyen/2.jpg'
            },
            {
                type: 'image',
                src: 'assets/phuyen/3.jpg'
            },
            {
                type: 'image',
                src: 'assets/phuyen/4.jpeg'
            },
            {
                type: 'image',
                src: 'assets/phuyen/5.jpeg'
            },
            {
                type: 'image',
                src: 'assets/phuyen/6.jpg'
            },
        ],
    },
    {
        id: 'tour6',
        name: 'Водопад Бахо и пляж Зоклет',
        content: `
<h2>
    Программа водопад Бахо и пляж Зоклет
</h2>
<p>
    По программе:
</p>
<ul>
    <li>1. Водопад Ба Хо, до которого мы с вами будем добираться через прекрасные виды джунглей</li>
    <li>2. Купание в трёхуровневом водопаде</li>
    <li>3. Бассейн на территории, в котором вы сможете охладиться перед следующей локацией</li>
    <li>4. Переезд на пляж</li>
    <li>5. Обед</li>
    <li>6. Пляжный отдых на территории курорта TTC</li>
</ul>

<h5>
    Стоимость 33$
</h5>
<p>
    С 07:00 до 16:00
</p>
<p>
    Гид — русский, включено: трансфер, обед, входные билеты
</p>

`,
        quote: `
<p>
    Заедут за вами в 07:00–07:15.
</p>
<p>
    Успейте позавтракать и ожидайте на ресепшене.
</p>
<p>
    С собой возьмите купальные принадлежности: купальник, полотенце, головной убор, солнцезащитный крем. Лучше надеть купальник заранее.
</p>
<p>
    Обязательно удобная обувь.
</p>
<p>
    Можете взять сменную одежду, чтобы не возвращаться в мокрой одежде.
</p>
<p>
    Возьмите деньги на личные расходы — мороженое, вода и прочее.
</p>
<p>
    Хорошего настроения ❤️
</p>

        `,
        gallery: [
            {
                type: 'image',
                src: 'assets/baho/1.webp'
            },
            {
                type: 'image',
                src: 'assets/baho/2.jpg'
            },
            {
                type: 'image',
                src: 'assets/baho/3.webp'
            },
            {
                type: 'image',
                src: 'assets/baho/4.webp'
            },
        ],
    },
    {
        id: 'tour7',
        name: 'Янг Бэй',
        content: `
<h2>
    «Янг Бэй»
</h2>
<p>
    Экологический парк Янг Бей расположен в 45 километрах от города Нячанга на высоте 550 метров над уровнем моря.
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Посещение крокодиловой фермы с возможностью покормить крокодилов</li>
    <li>2. Петушиные бои и поросячьи бега (возможность сделать ставку)</li>
    <li>3. Загадывание желания на волшебном дереве</li>
    <li>4. Кормление золотых карпов</li>
    <li>5. Купание в водопаде Янг-Бей с рыбками</li>
    <li>6. Купание в термальных источниках с температурой воды от 15 до 54 градусов</li>
    <li>7. Выступление племени Раглай</li>
</ul>

<h5>
    Стоимость 33$
</h5>
<p>
    С 07:00 до 16:00
</p>
<p>
    Включено: трансфер, входные билеты, шоу, термальные источники, гид
</p>

`,
        quote: `
<p>
    Заедут за вами в 07:00–07:15.
</p>
<p>
    Успейте позавтракать и ожидайте на ресепшене.
</p>
<p>
    С собой возьмите купальные принадлежности: купальник, полотенце, головной убор, солнцезащитный крем.
</p>
<p>
    Возьмите деньги на личные расходы — корм для животных, мороженое, вода.
</p>
<p>
    Хорошего настроения ❤️
</p>

        `,
        gallery: [
            {
                type: 'image',
                src: 'assets/yangbey/1.webp'
            },
            {
                type: 'image',
                src: 'assets/yangbey/2.webp'
            },
            {
                type: 'image',
                src: 'assets/yangbey/3.jpg'
            },
            {
                type: 'image',
                src: 'assets/yangbey/4.jpg'
            },
            {
                type: 'image',
                src: 'assets/yangbey/5.jpg'
            },
            {
                type: 'image',
                src: 'assets/yangbey/6.webp'
            },
            {
                type: 'image',
                src: 'assets/yangbey/7.webp'
            },
        ],
    },
    {
        id: 'tour8',
        name: 'Дайвинг',
        content: `
<h2>
    Дайвинг
</h2>
<p>
    Ныряем рядом с островом Мун. Глубины от 6 до 40 метров, с разным рельефом: коралловые рифы, каменные свалы, проходные пещеры.
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Выход на дайвинг на дайв-боте (переход ~60 минут)</li>
    <li>2. Два погружения по 40–45 минут</li>
    <li>3. Полный комплект снаряжения входит</li>
    <li>4. На лодке — чай, кофе, напитки, фрукты</li>
    <li>5. После второго погружения — обед</li>
    <li>6. Трансфер из отеля и обратно</li>
    <li>7. Фото и видео съёмка по желанию — 500.000 донгов с человека</li>
    <li>8. Возможность пройти курсы от OWD до Dive Master, открыть специализации</li>
</ul>

<h5>
    Стоимость: 90$ за два дайва / 45$ снорклинг
</h5>
<p>
    Выход из порта в 08:00, возвращение ~14:00
</p>
<p>
    Всё включено: трансфер, снаряжение, питание, сопровождение
</p>
<p>
    <strong>Противопоказания:</strong> беременность, недавние операции, острые приступы астмы, полёт на самолёте менее чем через 24 ч после погружения
</p>

`,
        quote: `
            <p>Обязательно уточняем места,есть ли свободные</p>
        `,
        gallery: [],
    },
    {
        id: 'tour9',
        name: 'Северные острова',
        content: `
<h2>
    Северные острова (Остров орхидей и остров обезьян)
</h2>
<p>
    Отправление в 07:00
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Остров Орхидей — живописный парк с орхидеями и растениями, морская прогулка по заливу Ня-Фу на комфортабельной лодке</li>
    <li>2. Шоу птиц и слонихи Лены, возможность прокатиться на слоне или страусе (по желанию, за доп. плату)</li>
    <li>3. Контактный парк с оленями и красивый пляж</li>
    <li>4. Обед</li>
    <li>5. Остров обезьян — наблюдение за обезьянами в дикой природе и цирковое шоу</li>
    <li>6. Свободное время и купание</li>
</ul>

<h5>
    Стоимость: уточняется
</h5>
<p>
    С 07:00 до 15:00 (возвращение в Нячанг)
</p>
<p>
    Включено: трансфер, лодка, обед, гид, входные билеты
</p>

`,
        quote: `
<p>
    Заедут за вами в 07:00–07:15.
</p>
<p>
    Успейте позавтракать и ожидайте на ресепшене.
</p>
<p>
    С собой возьмите купальные принадлежности: купальник, полотенце, головной убор, солнцезащитный крем.
</p>
<p>
    Возьмите деньги на личные расходы — корм для животных, мороженое, вода, катание на слоне.
</p>
<p>
    Хорошего настроения ❤️
</p>

        `,
        gallery: [
            {
                type: 'image',
                src: 'assets/northisland/1.jpg'
            },
            {
                type: 'image',
                src: 'assets/northisland/2.webp'
            },
            {
                type: 'image',
                src: 'assets/northisland/3.jpg'
            },
            {
                type: 'image',
                src: 'assets/northisland/4.jpg'
            },
            {
                type: 'image',
                src: 'assets/northisland/5.jpg'
            },
            {
                type: 'image',
                src: 'assets/northisland/6.png'
            },
            {
                type: 'image',
                src: 'assets/northisland/7.jpg'
            },
        ],
    },
    {
        id: 'tour10',
        name: 'Тур КВАДРОЦИКЛЫ и ZIPLINE',
        content: `
<h2>
    Тур КВАДРОЦИКЛЫ и ZIPLINE
</h2>
<p>
    Квадроциклы "ATV" тур в городе Нячанг. Увлекательное путешествие по джунглям с трансфером на площадку на удобном микроавтобусе.
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Трансфер из отеля в Нячанге (выезд в 08:00, 09:00 или 11:00)</li>
    <li>2. Прибытие на трассу</li>
    <li>3. Тур на квадроцикле ATV</li>
    <li>4. Обед (шведский стол)</li>
    <li>5. Возвращение в Нячанг</li>
</ul>

<h5>
    Стоимость (Квадроциклы):
</h5>
<p>
    49$ — трасса ~3 км (~60 мин)<br>
    75$ — трасса ~6 км (~120 мин)
</p>
<p>
    Включено: трансфер, гид на трассе, бутылка воды, обед
</p>
<p>
    <strong>Ограничения:</strong> дети 5–16 лет — только с родителем, от 16 лет — самостоятельно
</p>

<h5>
    Zipline (канатная дорога в джунглях, 13 платформ, ~1 час)
</h5>
<ul>
    <li>1. Трансфер из отеля (выезд в 08:00, 09:00 или 11:00)</li>
    <li>2. Прибытие на канатную дорогу</li>
    <li>3. Обед (шведский стол)</li>
    <li>4. Возвращение в Нячанг</li>
</ul>

<p>
    Стоимость:
    <br>Взрослый — 48$<br>Детский — 35$
</p>
<p>
    Включено: трансфер, бутылка воды
</p>
<p>
    <strong>Ограничения:</strong> рост от 120 см, вес 25–110 кг
</p>

<h5>
    Комбо-программа: Квадроциклы + Zipline — 75$
</h5>

`,
        quote: `

        `,
        gallery: [],
    },
    {
        id: 'tour11',
        name: 'Funny Party',
        content: `
<h2>
    Funny Party
</h2>
<p>
    Приём гостей начинается с 9:00 утра.
</p>
<p>
    Каждому гостю выдаётся одно полотенце и рюмочка фирменного напитка B52.
</p>
<p>
    В вашем распоряжении целый пляж с бесплатными шезлонгами и бассейном.
</p>
<p>
    Вы можете выбрать свой любимый напиток бесплатно из бара.
</p>
<p>
    С 10:30 DJ для вас играет современную музыку на профессиональном оборудовании.
</p>
<p>
    С 11:30 вас ждёт обед по системе «Шведский стол» с 40 разновидностями блюд.
    Обеденное время до 13:30.
</p>
<p>
    В 14:00 начинается пенная вечеринка и танцы у бассейна.
</p>
<p>
    16:30 — завершение программы.
</p>

<h5>
    Стоимость: уточняется
</h5>
<p>
    Включено: напитки, шезлонги, бассейн, обед, бар, DJ, пенная вечеринка
</p>

`,
        quote: `

        `,
        gallery: [],
    },
    {
        id: 'tour12',
        name: 'Морское приключение',
        content: `
<h2>
    Морское приключение
</h2>
<p>
    Выезд из отеля: 07:30–08:00<br>
    Отправление из порта: 08:30
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Ныряние с маской на коралловых рифах (до 10:00)</li>
    <li>2. Рыбалка (10:20 – 12:00)</li>
    <li>3. Обед (12:30)</li>
    <li>4. Отдых на пляже — купание, прыжки с лодки, сапборд, дискотека</li>
    <li>5. Возвращение в порт в 15:30</li>
</ul>

<h5>
    Стоимость 34$
</h5>
<p>
    Включено: трансфер от/до отеля, снаряжение, обед, развлекательная программа
</p>

`,
        quote: `
<p>
    Заедут за вами в 07:30–08:00.
</p>
<p>
    Успейте позавтракать и ожидайте на ресепшене.
</p>
<p>
    С собой возьмите купальные принадлежности: купальник, полотенце, головной убор, солнцезащитный крем.
</p>
<p>
    Возьмите деньги на личные расходы.
</p>
<p>
    Хорошего настроения ❤️
</p>

        `,
        gallery: [

        ],
    },
    {
        id: 'tour13',
        name: 'Малайзия',
        content: `
<h2>
    Малайзия: Куала-Лумпур, Путраджая и Гентинг Хайленд
</h2>
<p>
    Программа тура "Малайзия 3 города: Куала-Лумпур, Путраджая и Гентинг Хайленд"
</p>
<p>
    Отправление из Нячанга. Погрузитесь в удивительное путешествие по трём выдающимся городам Малайзии — каждый из них очаровывает своей уникальностью и атмосферой.
</p>
<p>
    По программе:
</p>
<ul>
    <li><strong>День 1: Куала-Лумпур</strong>
        <ul>
            <li>Перелёт из Нячанга, трансфер в отель с бассейном</li>
            <li>Вечерняя экскурсия: парк у башен Петронас, уличная еда</li>
            <li>Свободное время</li>
        </ul>
    </li>
    <li><strong>День 2: Путраджая, Бату, Гентинг Хайленд</strong>
        <ul>
            <li>Экскурсия в Путраджаю — город-парк с мечетью Путра</li>
            <li>Пещеры Бату — подъём по 272 ступеням к храмам</li>
            <li>Курорт Гентинг Хайленд — подъём по канатной дороге</li>
            <li>Обзорная экскурсия по Куала-Лумпуру (дворец, площадь Независимости, набережная)</li>
            <li>Ночной рынок в Китайском квартале</li>
            <li>Бар на вертолётной площадке с двумя напитками</li>
            <li>Посещение Walking Street и поездка на монорельсе</li>
        </ul>
    </li>
    <li><strong>День 3: Возвращение</strong>
        <ul>
            <li>Утренний трансфер в аэропорт и вылет в Нячанг</li>
        </ul>
    </li>
</ul>

<h5>
    Стоимость: уточняется
</h5>
<p>
    Включено: все входные билеты, трансферы, проживание в отеле с бассейном, услуги русского гида
</p>

`,
        quote: `
<p><strong>Стоимость тура:</strong></p>
<ul>
    <li>Группа из 2 человек: <strong>480$</strong> на человека</li>
    <li>Группа из 3 человек: <strong>420$</strong> на человека</li>
    <li>Группа из 4 человек: <strong>342$</strong> на человека</li>
    <li>Группа из 5 человек: <strong>300$</strong> на человека</li>
    <li>Группа из 6 человек: <strong>264$</strong> на человека</li>
</ul>
<p>Стоимость указана <strong>без авиабилетов</strong>.</p>
<p><strong>Цена от 500$ с билетами.</strong></p>

        `,
        gallery: [],
    },
    {
        id: 'tour14',
        name: 'Даклак',
        content: `
<h2>
    Программа Даклак
</h2>
<p>
    Экскурсия в дикий Вьетнам на границе с Камбоджей. Аутентичное путешествие в самое сердце экзотического Вьетнама!
</p>
<p>
    Даклак — провинция Вьетнама на плоскогорье Тэйнгуен.
</p>
<p>
    По программе:
</p>
<ul>
    <li><strong>День 1</strong></li>
    <li>08:00 — выезд из Нячанга, дорога через кофейные, каучуковые и сахарные плантации с фотопаузами</li>
    <li>12:30–13:30 — прибытие в деревню племени мнонгов, размещение в отеле у озера, обед</li>
    <li>14:30–15:30 — катание на слонах по деревне и озеру</li>
    <li>15:40–16:15 — посещение деревни мнонгов, знакомство с бытом</li>
    <li>16:45–17:30 — прогулка на лодках по озеру</li>
    <li>18:00 — встреча заката у озера</li>
    <li>19:00–21:00 — праздничный ужин и шоу племени мнонгов: танцы, музыка, местный ром, рассказы и песни</li>
</ul>

<ul>
    <li><strong>День 2</strong></li>
    <li>08:00–08:30 — завтрак у озера</li>
    <li>09:00–09:30 — экскурсия по вилле последнего императора Вьетнама</li>
    <li>09:30–11:50 — дорога к водопадам, остановка у "Камня-слона"</li>
    <li>12:00–13:30 — посещение водопада Драй Нур (одного из крупнейших во Вьетнаме)</li>
    <li>13:30–14:20 — обед</li>
    <li>14:30–19:00 — возвращение в Нячанг</li>
</ul>

<h5>
    Стоимость: 150$
</h5>
<p>
    Включено: трансфер, питание (1-й день — обед и ужин, 2-й день — завтрак и обед), русскоязычный гид, входные билеты, катание на слонах и лодках, вечернее шоу.
</p>
<p>
    Не включено: личные расходы, чаевые, доплата за одноместное размещение — 10$
</p>

`,
        quote: `

        `,
        gallery: [],
    },
    {
        id: 'tour15',
        name: 'Далат (2 дня)',
        content: `
<h2>
    Далат (2 дня)
</h2>
<p>
    Сбор из отеля с 5:00 до 5:30
</p>
<p>
    По программе:
</p>
<ul>
    <li><strong>День 1:</strong></li>
    <li>1. Горный перевал</li>
    <li>2. Озеро любви и французские кварталы</li>
    <li>3. Кофейные плантации</li>
    <li>4. Зоопарк. Ферма слонов и страусов (катание по желанию)</li>
    <li>5. Глиняная деревня (творческий парк, Лики Любви в бесконечном озере)</li>
    <li>6. Водопад Датанла (катание на санях за доп. плату — 130.000 донгов)</li>
    <li>7. Обед</li>
    <li>8. Crazy House — арт-отель</li>
    <li>9. Пагода Линь Фуок — входит в ТОП-10 самых необычных пагод мира</li>
    <li>10. Самый большой кофешоп в Далате</li>
    <li>Заселение в 3★ отель в центре Далата. Свободное время.</li>
</ul>

<ul>
    <li><strong>День 2:</strong></li>
    <li>1. Завтрак в отеле</li>
    <li>2. Водопад Понгур — самый большой в Далате</li>
    <li>3. Пагода Linh Ẩn</li>
    <li>4. Статуя Богини Гуань Инь — 72 метра</li>
    <li>5. Водопад Слон</li>
    <li>6. Шелковая фабрика</li>
    <li>7. Обед</li>
    <li>8. Долина любви</li>
    <li>9. Стеклянный мост длиной 325 метров с 7D-эффектами</li>
</ul>

<h5>
    Стоимость: уточняется
</h5>
<p>
    Включено: трансфер, проживание, питание, входные билеты (кроме саней на Датанле), гид
</p>

`,
        quote: `
        <p>
    Сбор гостей с 5:00 до 5:20 — будьте на ресепшене вовремя.
</p>
<p>
    С вечера до 18:00 попросите на ресепшене ланч-бокс — он пригодится на завтрак. В пути будет остановка на перекус.
</p>
<p>
    Не забудьте кофту — в горах прохладнее, чем в городе.
</p>
<p>
    Если у вас есть подушка для шеи, как на перелёты — возьмите с собой, чтобы ехать было комфортнее.
</p>
<p>
    Ненужные вещи можно оставлять в автобусе во время остановок. Ценные вещи берите с собой.
</p>
<p>
    При посещении пагод у девушек должны быть прикрыты плечи и колени.
</p>
<p>
    Возьмите наличные деньги в донгах на личные расходы: ужин, магазины, корм для животных.
</p>
<p>
    Дорога будет проходить по горному серпантину. Если вас укачивает, заранее купите в аптеке таблетки от укачивания.
</p>
<p>
    За дополнительную плату можно покататься на страусах и слонах, а также приобрести в кофешопе натуральный кофе, чай, лекарственные средства и сладости после дегустации.
</p>

        `,
        gallery: [
            {
                type: 'image',
                src: 'assets/dalat/2.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/3.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/4.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/5.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/6.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/7.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/8.webp'
            },
            {
                type: 'image',
                src: 'assets/dalat/9.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/10.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/11.jpg'
            },
            {
                type: 'image',
                src: 'assets/dalat/12.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/13.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/14.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/15.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/16.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/17.jpeg'
            },
            {
                type: 'image',
                src: 'assets/dalat/18.jpeg'
            },
        ],
    },
    {
        id: 'tour16',
        name: 'Обзорная экскурсия по Нячангу',
        content: `
<h2>
    Обзорная экскурсия по Нячангу
</h2>
<p>
    Сбор гостей: 10:00
</p>
<p>
    По программе:
</p>
<ul>
    <li>1. Музей океанографии — отличное место для знакомства с морскими обитателями, интересно как взрослым, так и детям</li>
    <li>2. Пагода Лонг Шон — главный Будда Нячанга. Расскажем об истории буддизма во Вьетнаме, гонениях 1957–1963 гг. и покажем смотровую площадку на город</li>
    <li>3. Кафедральный собор Святой Марии — главный католический храм Нячанга в готическом стиле. История католиков во Вьетнаме</li>
    <li>4. Обед</li>
    <li>5. Чамские башни — архитектура VIII века. История королевства Чамов, культура и быт древнего народа</li>
    <li>6. Сад камней — природный парк у моря с легендой, фото-зоной, мини-выставками музыкальных инструментов и народного творчества</li>
    <li>7. Vega City — современный район с красивой набережной и архитектурой</li>
</ul>

<h5>
    Стоимость: уточняется
</h5>
<p>
    Включено: трансфер, обед, входные билеты, услуги русскоязычного гида
</p>

`,
        quote: `

        `,
        gallery: [],
    },
    {
        id: 'tour17',
        name: 'Райский остров',
        content: `
<h2>
    Программа Райский остров
</h2>
<p>
    РАЙ СУЩЕСТВУЕТ — И ОН В НЯЧАНГЕ!
</p>
<p>
    Если вы устали от однотипных туров, хотите получить яркий контент и незабываемый отдых — тур на остров DoiDep станет идеальным выбором. Без очередей и суеты. Только вы, море, коктейли и эстетика.
</p>
<p>
    По программе:
</p>
<ul>
    <li>Трансфер от/до отеля</li>
    <li>Индивидуальный спидбот до острова</li>
    <li>Welcome drink при входе</li>
    <li>Экскурсия по океанариуму и пруду с хищными рыбами</li>
    <li>Бар без ограничений (коктейли, пиво, соки, фрукты)</li>
    <li>Два пляжа: Paradise (белоснежный) и Soi (яркий)</li>
    <li>Снорклинг на коралловом рифе (пляж Soi)</li>
    <li>Обед в ресторане 5★ отеля с видом на море</li>
    <li>Гамаки, шезлонги, пальмы, фото-зоны</li>
    <li>Пляжные активности</li>
</ul>

<p>
    Расписание:
</p>
<ul>
    <li>08:30–09:00 — сбор по отелям</li>
    <li>09:00–09:15 — прибытие в южный порт Нячанга</li>
    <li>09:30 — выезд на спидботе</li>
    <li>09:40 — прибытие на остров</li>
    <li>09:45–10:15 — экскурсия по океанариуму</li>
    <li>10:20 — отправление на пляж Paradise</li>
    <li>10:25 — размещение на пляже</li>
    <li>10:30–11:30 — снорклинг на пляже Soi (по желанию)</li>
    <li>12:00–13:00 — обед в ресторане у пляжа</li>
    <li>13:00–14:30 — отдых с баром на пляже Paradise</li>
    <li>14:35 — отправление с острова</li>
    <li>14:45 — возвращение в отель</li>
</ul>

<h5>
    Стоимость: уточняется
</h5>
<p>
    Всё включено: трансфер, питание, бар, экскурсии, снорклинг, пляжи и атмосфера ✨
</p>

`,
        quote: `

        `,
        gallery: [],
    },
    {
        id: 'tour18',
        name: 'Дананг 1 день',
        content: `
<h2>
    Дананг 1 день
</h2>
<p>
    Программа:
</p>
<ul>
    <li>18:00 — Сбор из отелей и отправление из Нячанга</li>
    <li>Переезд в Дананг на премиум спальном автобусе (лежачие места, 2 ряда, туалет)</li>
</ul>

<p><strong>1 день:</strong></p>
<ul>
    <li>06:00 — Прибытие в Дананг. Встреча с гидом</li>
    <li>07:00 — Завтрак в отеле 3★ (шведский стол)</li>
    <li>08:00 — Переезд в Ba Na Hills:</li>
    <ul>
        <li>Канатная дорога — самая длинная во Вьетнаме</li>
        <li>Золотой мост «Руки Бога»</li>
        <li>Парк развлечений, шоу с артистами</li>
        <li>Французская деревня, винодельня, храм на вершине</li>
    </ul>
    <li>12:00 — Обед (шведский стол)</li>
    <li>15:00 — Переезд в центр Дананга</li>
    <li>Осмотр моста Золотой дракон и Аллеи влюблённых</li>
    <li>19:00 — Отправление в Нячанг</li>
    <li>Ориентировочное прибытие в Нячанг — 06:00 следующего дня</li>
</ul>

<h5>
    Стоимость: уточняется
</h5>
<p>
    Включено: трансфер, гид, входные билеты, завтрак и обед, премиум автобус
</p>

`,
        quote: `
<p>
    За вами заедут в 18:00 (время может быть скорректировано — уточним дополнительно). До этого времени успейте поужинать и ожидайте на ресепшене.
</p>
<p>
    Возьмите с собой в автобус напитки и что-нибудь перекусить.
</p>
<p>
    Обязательно возьмите тёплую одежду — это горная местность, там значительно прохладнее. Одевайтесь теплее.
</p>
<p>
    С собой возьмите деньги на личные расходы — кофе, вода, магазины.
</p>
<p>
    Можно взять носки, сменную одежду для красивых фото, а ехать лучше в удобной одежде.
</p>
<p>
    Самое главное — хорошее настроение 😊
</p>

        `,
        gallery: [
            {
                type: 'image',
                src: 'assets/danang/1.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/2.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/3.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/4.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/5.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/6.jpeg'
            },
        ],
    },
    {
        id: 'tour19',
        name: 'Дананг + Хойан (2 дня)',
        content: `
<h2>
    Дананг + Хойан (2 дня)
</h2>
<p>
    Программа:
</p>
<ul>
    <li>18:00 — Отправление спального автобуса (лежачие места) из Нячанга в Дананг</li>
</ul>

<p><strong>1 день:</strong></p>
<ul>
    <li>06:00 — Прибытие автобуса в Дананг. Встреча с гидом</li>
    <li>07:00 — Завтрак</li>
    <li>08:00 — Поездка в горы Бана Хиллс:</li>
    <ul>
        <li>Осмотр 3 уровней</li>
        <li>Золотой мост «Руки Бога»</li>
        <li>Шоу с артистами</li>
        <li>Французская деревня</li>
        <li>Винодельня (вход оплачивается отдельно)</li>
        <li>Храм на вершине</li>
    </ul>
    <li>12:00 — Обед</li>
    <li>15:00 — Экскурсия по Данангу: мосты и достопримечательности</li>
    <li>18:00 — Переезд в Хойан, заселение в отель</li>
    <li>19:30 — Свободное время для прогулок по городу-музею Хойан (объект ЮНЕСКО)</li>
</ul>

<p><strong>2 день:</strong></p>
<ul>
    <li>07:00 — Завтрак</li>
    <li>08:00 — Обзорная экскурсия по историческому центру Хойана</li>
    <li>12:00 — Прогулка на лодках по мангровым рощам</li>
    <li>13:00 — Обед</li>
    <li>14:30 — Посещение Мраморных гор и пещер</li>
    <li>17:00 — Возвращение в Дананг</li>
    <li>Выезд в Нячанг</li>
    <li>Ориентировочное прибытие в Нячанг — 05:00–06:00</li>
</ul>

<h5>
    Стоимость: уточняется
</h5>
<p>
    Включено: трансфер, спальный автобус, отель, питание (завтраки и обеды), гид, входные билеты (кроме винодельни)
</p>
<p>
    *Порядок посещения локаций может меняться
</p>

`,
        quote: `
<p>
    За вами заедут в 18:00 (время может быть скорректировано — уточним дополнительно). До этого времени успейте поужинать и ожидайте на ресепшене.
</p>
<p>
    Возьмите с собой в автобус напитки и что-нибудь перекусить.
</p>
<p>
    Обязательно возьмите тёплую одежду — это горная местность, там значительно прохладнее. Одевайтесь теплее.
</p>
<p>
    С собой возьмите деньги на личные расходы — кофе, вода, магазины.
</p>
<p>
    Можно взять носки, сменную одежду для красивых фото, а ехать лучше в удобной одежде.
</p>
<p>
    Купальные принадлежности также пригодятся — будет возможность искупаться.
</p>
<p>
    В Хойане теплее, чем на горе. Там вас ждёт свободный вечер, ужин планируйте в кафе.
</p>
<p>
    Самое главное — хорошее настроение 😊
</p>

        `,
        gallery: [
            {
                type: 'image',
                src: 'assets/danang/1.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/2.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/3.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/4.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/5.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/6.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/7.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/8.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/9.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/10.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/11.jpeg'
            },
            {
                type: 'image',
                src: 'assets/danang/12.jpeg'
            },
        ],
    },
])

const activeLink = ref(null)
const isMenuOpen = ref(false)

function goTo(id, containerSelector = null) {
    const element = document.getElementById(id);
    if (!element) return;

    const container = document.querySelector('#content');
    if (container && container.contains(element)) {
        const topPos = element.offsetTop;
        container.scrollTo({
            top: topPos,
            behavior: 'smooth'
        });
    }
}

function openMenu() {
    isMenuOpen.value = true
}

function closeMenu() {
    isMenuOpen.value = false
}

function toggleMenu() {
    isMenuOpen.value = !isMenuOpen.value
}

function trackScrollActiveLinks() {
    const container = document.querySelector('#content');
    const articles = document.querySelectorAll('.ct-article');

    articles.forEach(article => {
        if(container.scrollTop >= article.offsetTop && container.scrollTop < article.offsetTop + article.offsetHeight){
            activeLink.value = article.id
        }
    })
}

onMounted(function (){
    const content = document.getElementById('content')
    content.addEventListener('scroll', function (){
        trackScrollActiveLinks()
    })
    trackScrollActiveLinks()

    Fancybox.bind("[data-fancybox]");

    window.addEventListener('resize', function (){
        closeMenu()
    })
})

</script>

<template>
    <main class="ct-main">
        <div class="ct-menu--layout" @click.prevent="closeMenu" :class="{active: isMenuOpen}"></div>
        <button class="ct-menu--btn" @click.prevent="toggleMenu" :class="{active: isMenuOpen}">
            <span></span>
            <span></span>
            <span></span>
        </button>

        <div class="ct-sidebar p-3 text-bg-dark" :class="{active: isMenuOpen}">
            <ul class="nav nav-pills flex-column mb-auto gap-2">
                <li class="nav-item" v-for="tour in tours" :key="tour.id">
                    <a :href="tour.id" class="nav-link text-light"
                       :class="{active: tour.id === activeLink}"
                        @click.prevent="goTo(tour.id)"
                    >
                        {{ tour.name }}
                    </a>
                </li>
            </ul>
        </div>
        <div class="ct-content px-4" id="content">
            <template v-for="tour in tours" :key="tour.id">
                <div class="ct-article pt-4 pb-4" :id="tour.id">
                    <article v-html="tour.content">

                    </article>
                    <div class="ct-quote border p-2" v-if="tour.quote" v-html="tour.quote">

                    </div>
                    <div class="ct-gallery mt-4" v-if="tour.gallery && tour.gallery.length > 0">
                        <div class="ct-gallery--item" v-for="(item, index) in tour.gallery" :key="index">
                            <a :href="item.src" data-fancybox="gallery" :data-caption="tour.name">
                                <img :src="item.src" alt="pic" v-if="item.type === 'image'">
                                <video :src="item.src" v-else-if="item.type === 'video'"></video>
                            </a>
                        </div>
                    </div>
                </div>
                <hr>
            </template>
        </div>
    </main>
</template>

<style lang="scss">
@import "bootstrap/scss/bootstrap";

html{
    @media (max-width: 960px){
        font-size: 14px;
    }
}

.ct-main{
    display: grid;
    grid-template-columns: minmax(240px, 300px) 1fr;
    height: 100dvh;
    align-items: stretch;

    @media (max-width: 960px){
        display: block;
    }
}

.ct-sidebar{
    height: 100dvh;
    overflow: auto;

    @media (max-width: 960px){
        position: fixed;
        top: 0;
        left: 0;
        width: 100%;
        max-width: 300px;
        z-index: 10;
        box-shadow: 0px 0px 10px 0px rgba(0,0,0,0.5);
        transition: 0.3s;

        &:not(.active){
            transform: translateX(-110%);
        }
    }
}

.ct-content{
    height: 100dvh;
    overflow: auto;
}

.nav-link{
    padding: 5px 10px;
    font-size: 14px;
}

.ct-quote{
    p{
        margin: 0;
        font-size: 13px;
    }
}

.ct-gallery{
    display: grid;
    grid-template-columns: repeat(6, 1fr);
    gap: 20px;

    @media (max-width: 960px){
        grid-template-columns: repeat(4, 1fr);
        gap: 10px;
    }

    @media (max-width: 768px){
        grid-template-columns: repeat(3, 1fr);
    }

    @media (max-width: 420px){
        grid-template-columns: repeat(2, 1fr);
    }

    &--item{
        height: 120px;

        @media (max-width: 960px){
            height: 100px;
        }

        a, img, video{
            display: block;
            height: 100%;
            width: 100%;
            object-fit: cover;
        }
    }
}

.ct-menu--layout{
    position: fixed;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    z-index: 9;
    background-color: rgba(0,0,0,0.1);
    transition: 0.3s;

    &:not(.active){
        pointer-events: none;
        opacity: 0;
    }
}

.ct-menu--btn{
    width: 60px;
    position: fixed;
    top: 0;
    right: 0;
    z-index: 5;
    padding: 10px;
    display: flex;
    flex-direction: column;
    gap: 8px;
    background-color: black;
    border: none;

    @media (min-width: 961px){
        display: none;
    }

    span{
        display: block;
        width: 100%;
        height: 3px;
        background-color: white;
        border-radius: 3px;
        transition: 0.3s;
    }

    &.active{
        span{
            &:nth-of-type(1){
                transform: translateY(10px) rotate(-45deg);
            }

            &:nth-of-type(3){
                transform: translateY(-10px) rotate(45deg);
            }

            &:nth-of-type(2){
                opacity: 0;
                transform: scale(0);
            }
        }
    }
}

</style>
